## Setup the environment

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation
Creating series which are one dimensional ndarray with axis labels

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a Data Frame by passing a numpy array, with a dattime index and labeled columns:

In [3]:
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Use the generated dates column to set up the rownames for the next data frame

In [4]:
df=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

Create a dataframe by passing a dictionary of objects that can be converted to series like

In [5]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(['test','train','test','train']),
                 'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing the data

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693

In [8]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

Display the index, columns, and the underlying numpy data

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [12]:
df.values

array([[  3.32025233e-01,   1.91485598e+00,  -3.67749686e+00,
          2.45595280e-03],
       [ -8.58143676e-01,  -5.20919897e-01,  -1.47766291e+00,
         -1.29145817e+00],
       [ -2.06767138e-01,   1.08867892e+00,   7.28643814e-01,
          5.38243996e-02],
       [  2.54807274e-01,   8.56771453e-02,  -9.93414206e-01,
         -8.10199923e-01],
       [  1.28820119e-01,  -5.30240195e-01,   3.76225494e-02,
          1.03569330e+00],
       [ -6.12818970e-01,  -1.04446469e+00,  -5.84802669e-01,
         -3.85334665e-01]])

The following shows that by a simple call to the describe function on a given dataframe, a variety of data summary is created

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.160346  0.165598 -0.994518 -0.232503
std    0.488305  1.125888  1.525403  0.802993
min   -0.858144 -1.044465 -3.677497 -1.291458
25%   -0.511306 -0.527910 -1.356601 -0.703984
50%   -0.038974 -0.217621 -0.789108 -0.191439
75%    0.223310  0.837928 -0.117984  0.040982
max    0.332025  1.914856  0.728644  1.035693

Transposing the data

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.332025   -0.858144   -0.206767    0.254807    0.128820   -0.612819
B    1.914856   -0.520920    1.088679    0.085677   -0.530240   -1.044465
C   -3.677497   -1.477663    0.728644   -0.993414    0.037623   -0.584803
D    0.002456   -1.291458    0.053824   -0.810200    1.035693   -0.385335

In [15]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

Sorting Operations

Sorting a dataframe based on the indexed called?

In [16]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-01  0.332025  1.914856 -3.677497  0.002456

In [17]:
df2.sort_index(axis=0)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Sorting by values

In [18]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

## Selection

### Getting

Selecting a single column, which yields a series, equivalent to df.A

In [19]:
df['A']

2013-01-01    0.332025
2013-01-02   -0.858144
2013-01-03   -0.206767
2013-01-04    0.254807
2013-01-05    0.128820
2013-01-06   -0.612819
Freq: D, Name: A, dtype: float64

In [20]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df2['B']

0   2013-01-02
1   2013-01-02
2   2013-01-02
3   2013-01-02
Name: B, dtype: datetime64[ns]

Selecting multiple different columns

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824

In [23]:
df[0:]

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

In [24]:
df2[0:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### Selection by label

This is for getting a cross section using a label/ Or rather using this as a way to obtain the

In [25]:
df.loc[dates[5]]

A   -0.612819
B   -1.044465
C   -0.584803
D   -0.385335
Name: 2013-01-06 00:00:00, dtype: float64

In [26]:
df

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

Selecting multiple different rows by label

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.332025  1.914856
2013-01-02 -0.858144 -0.520920
2013-01-03 -0.206767  1.088679
2013-01-04  0.254807  0.085677
2013-01-05  0.128820 -0.530240
2013-01-06 -0.612819 -1.044465

In [28]:
df.loc['20130102':'20130106',["A","B"]]

                   A         B
2013-01-02 -0.858144 -0.520920
2013-01-03 -0.206767  1.088679
2013-01-04  0.254807  0.085677
2013-01-05  0.128820 -0.530240
2013-01-06 -0.612819 -1.044465

Reduction in the dimensions of the returned object

In [29]:
df.loc['20130102',['A','B']]

A   -0.858144
B   -0.520920
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A'
      ]

0.33202523290767194

### Selection by position. 
Notice that when selecting values by position instead of the columns or labels. The difference in the key word API invoked. One is using loc vs iloc

In [31]:
df.iloc[3]

A    0.254807
B    0.085677
C   -0.993414
D   -0.810200
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

using integers to directly slice the dataframe

In [33]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.254807  0.085677
2013-01-05  0.128820 -0.530240

In [34]:
df2.iloc[1:,2:]

     C  D      E    F
1  1.0  3  train  foo
2  1.0  3   test  foo
3  1.0  3  train  foo

Slicing rows explicitly

In [35]:
df.iloc[1,:]

A   -0.858144
B   -0.520920
C   -1.477663
D   -1.291458
Name: 2013-01-02 00:00:00, dtype: float64

In [36]:
df

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

For selecting columns explicitly

In [37]:
df.iloc[:,2]

2013-01-01   -3.677497
2013-01-02   -1.477663
2013-01-03    0.728644
2013-01-04   -0.993414
2013-01-05    0.037623
2013-01-06   -0.584803
Freq: D, Name: C, dtype: float64

### Boolean Indexing
Using a single column's values to select data

In [38]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693

In [39]:
df[df.B>1]

                   A         B         C         D
2013-01-01  0.332025  1.914856 -3.677497  0.002456
2013-01-03 -0.206767  1.088679  0.728644  0.053824

Selecting values from a data frame where a boolean conditions is met

In [40]:
df[df>0]

                   A         B         C         D
2013-01-01  0.332025  1.914856       NaN  0.002456
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677       NaN       NaN
2013-01-05  0.128820       NaN  0.037623  1.035693
2013-01-06       NaN       NaN       NaN       NaN

Using the isin() method for filtering:

In [41]:
df2=df.copy()
df2['E']=['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  0.332025  1.914856 -3.677497  0.002456    one
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458    one
2013-01-03 -0.206767  1.088679  0.728644  0.053824    two
2013-01-04  0.254807  0.085677 -0.993414 -0.810200  three
2013-01-05  0.128820 -0.530240  0.037623  1.035693   four
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335  three

In [42]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.206767  1.088679  0.728644  0.053824   two
2013-01-05  0.128820 -0.530240  0.037623  1.035693  four

### Setting

Setting a new column automatically aligns the data by the indexes

In [43]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label

In [44]:
df.at[dates[0],'A']=0

In [45]:
df

                   A         B         C         D
2013-01-01  0.000000  1.914856 -3.677497  0.002456
2013-01-02 -0.858144 -0.520920 -1.477663 -1.291458
2013-01-03 -0.206767  1.088679  0.728644  0.053824
2013-01-04  0.254807  0.085677 -0.993414 -0.810200
2013-01-05  0.128820 -0.530240  0.037623  1.035693
2013-01-06 -0.612819 -1.044465 -0.584803 -0.385335

Setting values by position within the data frame
Note that similar to the slicing and dicing the data frame by labels, the keyword is loc and when slicing and dicing the dataframe by values of the dataframe, iloc is used. In setting the values of a specific cell within a a dataframe using label at is used and conversely, when refering the the specific position within the cell, the iat keywork/API is used

In [46]:
df.iat[0,1]

1.9148559751395784

In [47]:
df.iat[0,1]=1

In [48]:
df.loc[:,'D']=np.array([5]*len(df))

In [49]:
df

                   A         B         C  D
2013-01-01  0.000000  1.000000 -3.677497  5
2013-01-02 -0.858144 -0.520920 -1.477663  5
2013-01-03 -0.206767  1.088679  0.728644  5
2013-01-04  0.254807  0.085677 -0.993414  5
2013-01-05  0.128820 -0.530240  0.037623  5
2013-01-06 -0.612819 -1.044465 -0.584803  5

In [50]:
df2=df.copy()

In [51]:
df2[df2>0]=-df2
df2

                   A         B         C  D
2013-01-01  0.000000 -1.000000 -3.677497 -5
2013-01-02 -0.858144 -0.520920 -1.477663 -5
2013-01-03 -0.206767 -1.088679 -0.728644 -5
2013-01-04 -0.254807 -0.085677 -0.993414 -5
2013-01-05 -0.128820 -0.530240 -0.037623 -5
2013-01-06 -0.612819 -1.044465 -0.584803 -5

## Missing Data
Pandas primarily uses the value np.nan to represent missing data. Missing data by default isn't included as a part of the computation. 
Reindexing allows to change/add/delete the index on a specific axis.

In [52]:
df1=df.reindex(index=dates[:4],columns=list(df.columns)+['E'])

In [53]:
df1

                   A         B         C  D   E
2013-01-01  0.000000  1.000000 -3.677497  5 NaN
2013-01-02 -0.858144 -0.520920 -1.477663  5 NaN
2013-01-03 -0.206767  1.088679  0.728644  5 NaN
2013-01-04  0.254807  0.085677 -0.993414  5 NaN

In [54]:
df1.loc[dates[0]:dates[1],'E']=1

In [55]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  1.000000 -3.677497  5  1.0
2013-01-02 -0.858144 -0.520920 -1.477663  5  1.0
2013-01-03 -0.206767  1.088679  0.728644  5  NaN
2013-01-04  0.254807  0.085677 -0.993414  5  NaN

Dropping any rows that have missing data

In [56]:
df1.dropna(how="any")

                   A        B         C  D    E
2013-01-01  0.000000  1.00000 -3.677497  5  1.0
2013-01-02 -0.858144 -0.52092 -1.477663  5  1.0

In [57]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  1.000000 -3.677497  5  1.0
2013-01-02 -0.858144 -0.520920 -1.477663  5  1.0
2013-01-03 -0.206767  1.088679  0.728644  5  NaN
2013-01-04  0.254807  0.085677 -0.993414  5  NaN

In [58]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  1.000000 -3.677497  5  1.0
2013-01-02 -0.858144 -0.520920 -1.477663  5  1.0
2013-01-03 -0.206767  1.088679  0.728644  5  5.0
2013-01-04  0.254807  0.085677 -0.993414  5  5.0

In [62]:
pd.isna(df1)

AttributeError: module 'pandas' has no attribute 'isna'

In [119]:
pd.__version__

'0.20.3'

## Operations
### Stats
Performing descriptive statistics

In [66]:
df3=pd.DataFrame(np.random.randn(6,7),
                 index=pd.date_range('20170101',periods=6),columns=list("ABCDEFG"))

In [67]:
df3.mean()

A    0.605098
B    0.253050
C   -0.229021
D    0.335270
E   -0.502166
F   -0.089988
G   -0.455048
dtype: float64

Calculating the mean of a specific column

In [68]:
df3.mean(1)

2017-01-01   -0.809557
2017-01-02    0.213125
2017-01-03    0.273864
2017-01-04    0.523322
2017-01-05    0.374558
2017-01-06   -0.646288
Freq: D, dtype: float64

In [69]:
df3

,A,B,C,D,E,F,G
2017-01-01,-0.613315,0.205397,-2.291603,0.421231,-2.238601,-0.491499,-0.658508
2017-01-02,-0.039049,-0.654333,1.979689,-0.209725,-0.191212,0.336623,0.269880
2017-01-03,1.888367,1.941577,-0.390354,-0.238762,0.535414,-0.369075,-1.450119
2017-01-04,1.098176,0.493547,-1.354320,1.064830,2.710484,-1.871495,1.522034
2017-01-05,-0.002816,-0.583127,1.239182,1.468564,-0.693751,1.143995,0.049860
2017-01-06,1.299223,0.115237,-0.556721,-0.494516,-3.135330,0.711526,-2.463434

In [73]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [72]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [74]:
df.sub(s,axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.206767  0.088679 -0.271356  4.0
2013-01-04 -2.745193 -2.914323 -3.993414  2.0
2013-01-05 -4.871180 -5.530240 -4.962377  0.0
2013-01-06       NaN       NaN       NaN  NaN

### Apply
This is similar to r. This applies functions to the data directly

In [75]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  1.000000 -3.677497   5
2013-01-02 -0.858144  0.479080 -5.155160  10
2013-01-03 -1.064911  1.567759 -4.426516  15
2013-01-04 -0.810104  1.653436 -5.419930  20
2013-01-05 -0.681283  1.123196 -5.382308  25
2013-01-06 -1.294102  0.078731 -5.967110  30

In [76]:
df.apply(lambda x:x.max()-x.min())

A    1.112951
B    2.133144
C    4.406141
D    0.000000
dtype: float64

## Histogramming

In [77]:
s=pd.Series(np.random.randint(0,7,10))

In [78]:
s

0    2
1    6
2    4
3    4
4    3
5    3
6    4
7    5
8    2
9    4
dtype: int64

In [79]:
s.value_counts()

4    4
3    2
2    2
6    1
5    1
dtype: int64

## String Methods

In [80]:
s=pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','do','cat'])

In [81]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7      do
8     cat
dtype: object

In [82]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7      do
8     cat
dtype: object

## Merging

In [83]:
df=pd.DataFrame(np.random.randn(10,4))

In [84]:
df

          0         1         2         3
0  0.686102 -1.412511  0.224090  1.895493
1  0.506826 -0.487092  2.075672 -0.695955
2 -0.331095  0.049362 -0.159401 -0.146813
3 -2.258973 -0.154258 -0.709831 -0.364875
4  1.707706 -0.247017  0.330152  0.070614
5  0.136448 -0.775116 -0.093085 -0.520561
6  0.332171  0.178246  0.294412 -0.166502
7 -0.906656  0.235083 -0.294537 -0.017711
8  1.356674  0.331295 -1.098166  0.035047
9 -1.139940  0.278829 -0.370841 -3.124621

In [86]:
#Breaking it into pieces
pieces=[df[:3],df[3:7],df[7:]]

In [87]:
pieces

[          0         1         2         3
 0  0.686102 -1.412511  0.224090  1.895493
 1  0.506826 -0.487092  2.075672 -0.695955
 2 -0.331095  0.049362 -0.159401 -0.146813,
           0         1         2         3
 3 -2.258973 -0.154258 -0.709831 -0.364875
 4  1.707706 -0.247017  0.330152  0.070614
 5  0.136448 -0.775116 -0.093085 -0.520561
 6  0.332171  0.178246  0.294412 -0.166502,
           0         1         2         3
 7 -0.906656  0.235083 -0.294537 -0.017711
 8  1.356674  0.331295 -1.098166  0.035047
 9 -1.139940  0.278829 -0.370841 -3.124621]

In [88]:
pd.concat(pieces)

          0         1         2         3
0  0.686102 -1.412511  0.224090  1.895493
1  0.506826 -0.487092  2.075672 -0.695955
2 -0.331095  0.049362 -0.159401 -0.146813
3 -2.258973 -0.154258 -0.709831 -0.364875
4  1.707706 -0.247017  0.330152  0.070614
5  0.136448 -0.775116 -0.093085 -0.520561
6  0.332171  0.178246  0.294412 -0.166502
7 -0.906656  0.235083 -0.294537 -0.017711
8  1.356674  0.331295 -1.098166  0.035047
9 -1.139940  0.278829 -0.370841 -3.124621

## SQL style merges/Joins

In [90]:
left=pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [94]:
right=pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
right

   key  rval
0  foo     4
1  foo     5

In [95]:
pd.merge(left,right,on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Appending rows to the dataframe

In [96]:
df=pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])

In [97]:
df

          A         B         C         D
0  1.077850  0.433068  1.559432  1.830480
1  1.302413  1.531036  1.497585  0.397167
2  1.057186  1.289607  1.386656  1.819455
3  0.738407 -0.940804  0.341311 -1.541025
4  1.134636  1.585610 -1.747127 -0.462143
5  0.561871  0.557715 -1.122578  0.389663
6  0.323426 -0.304766  0.100727  2.075142
7  1.323365 -0.081341 -0.321819 -0.498573

In [98]:
s=df.iloc[3]
s

A    0.738407
B   -0.940804
C    0.341311
D   -1.541025
Name: 3, dtype: float64

In [99]:
df.append(s,ignore_index=True)

          A         B         C         D
0  1.077850  0.433068  1.559432  1.830480
1  1.302413  1.531036  1.497585  0.397167
2  1.057186  1.289607  1.386656  1.819455
3  0.738407 -0.940804  0.341311 -1.541025
4  1.134636  1.585610 -1.747127 -0.462143
5  0.561871  0.557715 -1.122578  0.389663
6  0.323426 -0.304766  0.100727  2.075142
7  1.323365 -0.081341 -0.321819 -0.498573
8  0.738407 -0.940804  0.341311 -1.541025

## Grouping
Group by operations have the following several processes:
1. Splitting the data into groups based on some criteria
2. Applying a function to each group independently
3. Combining the results into a data structure

In [100]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                       'foo', 'bar', 'foo', 'foo'],
                'B' : ['one', 'one', 'two', 'three',
                       'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                  'D' : np.random.randn(8)})

In [101]:
df

     A      B         C         D
0  foo    one  0.804259 -0.511468
1  bar    one  0.486138  1.245987
2  foo    two -0.540468  0.344190
3  bar  three -0.133089  0.512919
4  foo    two  0.850443  0.180936
5  bar    two -0.626433  0.656099
6  foo    one -1.456528  1.691852
7  foo  three -2.113231 -0.137818

In [103]:
df.groupby('A').sum()

            C         D
A
bar -0.273384  2.415005
foo -2.455525  1.567692

In [105]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.486138  1.245987
    three -0.133089  0.512919
    two   -0.626433  0.656099
foo one   -0.652269  1.180385
    three -2.113231 -0.137818
    two    0.309974  0.525125

## Reshaping
Stacking

In [109]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [108]:
print(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

<zip object at 0x10b8cee08>

In [110]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [114]:
index=pd.MultiIndex.from_tuples(tuples,names=['first','second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [112]:
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])

In [113]:
df

                     A         B
first second
bar   one     0.066867 -0.077748
      two    -0.930788  2.090001
baz   one    -0.089160  2.347967
      two     0.276219  0.408613
foo   one     0.336894  0.751330
      two    -0.563941  0.638288
qux   one    -0.600790 -0.465958
      two    -1.066837 -0.167855

In [115]:
df2=df[:4]

In [116]:
df2

                     A         B
first second
bar   one     0.066867 -0.077748
      two    -0.930788  2.090001
baz   one    -0.089160  2.347967
      two     0.276219  0.408613

In [120]:
stacked=df2.stack()

In [121]:
stacked

first  second
bar    one     A    0.066867
               B   -0.077748
       two     A   -0.930788
               B    2.090001
baz    one     A   -0.089160
               B    2.347967
       two     A    0.276219
               B    0.408613
dtype: float64

Stack means compressing levels in data frame's columns

In [123]:
stacked1=df.stack()
stacked1

first  second
bar    one     A    0.066867
               B   -0.077748
       two     A   -0.930788
               B    2.090001
baz    one     A   -0.089160
               B    2.347967
       two     A    0.276219
               B    0.408613
foo    one     A    0.336894
               B    0.751330
       two     A   -0.563941
               B    0.638288
qux    one     A   -0.600790
               B   -0.465958
       two     A   -1.066837
               B   -0.167855
dtype: float64